public/signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
            <soapenv:Header/>
            <soapenv:Body><RegisterInvoiceRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="https://efi.tax.gov.me/fs/schema" Id="Request" Version="1">
    <Header SendDateTime="2021-04-28T21:30:41+02:00" UUID="6d3d7d1b-ee0d-46b7-9eb0-3737ce499087"/>

    <Invoice TypeOfInv="CASH" IsSimplifiedInv="false" IssueDateTime="2021-04-28T21:30:41+02:00" InvNum="ya260ri698/60/2021/wp886vu280" InvOrdNum="60" TCRCode="wp886vu280" IsIssuerInVAT="true" TotPriceWoVAT="75.84" TotVATAmt="71.71" TotPrice="75.84" OperatorCode="ia871me776" BusinUnitCode="ya260ri698" SoftCode="qk433mq872" IIC="38c0e4df9a7aefb6d97f5647d7d78417" IICSignature="35bf9fa9e4d8fc7423ba6eb25ec955af60158a2eaacde686a29ee062615d83d7ea7621ab4649ad1fb298c5cc704648897ecc733d6936ed32ec1284740603091158022b0b5417b7d4dd97fb516163ca57501f6582e429b2f565dee650c0e09511bdcb919ee3a9defd323f999f49cdfb910ec93214c7d169bef1b5dc65af2eb8c4d028c71db194f4a723959109afd78283f65c7b8c14554e2c6bd49b21cbd094605b0d510ad1a8e740eaff63effc8e34d88b5113fd8547404cc792c049664136c63dae99007c30837ca63d06585aa744487eb8506abc949e6ea1b4a389d4dbdeb7416d9b11f65dfe69de67b7df1e944ce01e1a63eaec472650dc730c60440388d0" IsReverseCharge="false">
        <PayMethods>
            <PayMethod Type="BANKNOTE" Amt="75.84"/>
        </PayMethods>

        <Seller IDType="TIN" IDNum="02829258" Name="Crnagoraput"/>

        <Buyer IDType="TIN" IDNum="12345678" Name="Cvijeta"/>

        <Items>
                            <I N="et" C="0" U="m2" Q="1.00" UPB="75.84" UPA="0.00" R="0.00" RR="1" PB="0.00" VR="0.21" VA="71.71" PA="75.84"/>
                    </Items>

        <SameTaxes>
                                                                                                        <SameTax NumOfItems="1" PriceBefVAT="75.84" VATRate="21.00" VATAmt="71.71"/>
                                    </SameTaxes>
    </Invoice>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
  <SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
    <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
  <Reference URI="#Request"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><DigestValue>pxAmmcGVJdkLJTetNYPwXTLXjRtt7PO3k1z1ku8AwH8=</DigestValue></Reference></SignedInfo><SignatureValue>htbvwHyAIAVOZx/EAUi44H4ZsotAEJiSOA7kvf49QtpztTJj/o081CgjkQwRbRtxOsRvebX3FOoigIGlihqWTxGPSqXWQfkH9yoFxZz7Dx47su7f3+Hedb8r4BSzw/Zb/bF+JCBjk5LlOsL4BO/RyZavXa88iP/TbKDjeXzwofRZEB5EM/RTGCYYxYuz+e1JteevF8BLk5K7a55MTW5Uc7Z8e2Y4Ypn5hNuMG5c2hVSZiBpvOzu71zqkI2RRs4lSN7ANLfLB2d5n/MOCFVcDoGNhHjesk5bb0kps4ZeQOpcPTiQ4J1X2rdEPH8PR1361451lBYYV5zwwLF/TvmaAvA==</SignatureValue>
<KeyInfo><X509Data><X509Certificate>MIIHHTCCBYWgAwIBAgIEXQMMRjANBgkqhkiG9w0BAQsFADA0MQswCQYDVQQGEwJt
ZTEQMA4GA1UEChMHUG9zdGFDRzETMBEGA1UEAxMKUG9zdGFDRyBDQTAeFw0yMTAx
MTIwNzEzMDVaFw0yNDAxMTIwNzQzMDVaMIGAMQswCQYDVQQGEwJNRTEUMBIGA1UE
CxMLUHJhdm5vIGxpY2UxMTAVBgNVBGETDlZBVE1FLTAyODI5MjU4MBgGA1UEChMR
UkVTVEFSVCBJVCBkLm8uby4xKDAMBgNVBAUTBTQyODY0MBgGA1UEAxMRUkVTVEFS
VCBJVCBkLm8uby4wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQC0u6vT
75aX4Etzpo/RU8afyOoWQUe+FmpL7sL/jpJFPMte6OMgbms3qqWRYsgR2oJ2YU9d
mHZV7Cy+EEbdfV73IkIStkJuLyHHT+kxkp+dXLcykEe23e7VLnkCPzJ2nU4HUs4G
S6fTth4Z36srmgcFfJz3LHy8ii80/753A5sEjKWDbjrnvyTYr1v3i4WjGS61tqcW
LFdst9K7y5PiGB3KZeGkG0qg7iYLHTmo27ekVyNjAlgFiR/xNURM+hOJCH0DTHS5
SJ5VvdQ3PMczL74VEXKye6MgDtMeBH9UEZPOFsaOaqT4dfq+FL/Kd65a+qDFAez0
eZGcyPoWqa7rC8VRAgMBAAGjggNoMIIDZDAOBgNVHQ8BAf8EBAMCBsAwRQYDVR0g
BD4wPDA6BgwrBgEEAYKfAQEGAQQwKjAoBggrBgEFBQcCARYcaHR0cDovL3d3dy5w
b3N0YWNnLWNhLm1lL2NwczCBsgYIKwYBBQUHAQMEgaUwgaIwCAYGBACORgEBMIGA
BgYEAI5GAQUwdjA5FjNodHRwczovL3d3dy5wb3N0YWNnLWNhLm1lL2Nwcy9wb3N0
YWNnLWNhX3Bkc19lbi5wZGYTAmVuMDkWM2h0dHBzOi8vd3d3LnBvc3RhY2ctY2Eu
bWUvY3BzL3Bvc3RhY2ctY2FfcGRzX3NyLnBkZhMCc3IwEwYGBACORgEGMAkGBwQA
jkYBBgIwTgYIKwYBBQUHAQEEQjBAMD4GCCsGAQUFBzAChjJodHRwOi8vd3d3LnBv
c3RhY2ctY2EubWUvY2VyL1Bvc3RhQ0ctQ0FfY2FjZXJ0LmNlcjCBgAYDVR0SBHkw
d6R1MHMxCzAJBgNVBAYTAk1FMTYwNAYDVQQKEy1QT1NUQSBDUk5FIEdPUkUgQUtD
SU9OQVJTS08gRFJVU1RWTyBQT0RHT1JJQ0ExFzAVBgNVBGETDlZBVE1FLTAyODY3
OTQwMRMwEQYDVQQDEwpQb3N0YUNHIENBMIIBQQYDVR0fBIIBODCCATQwTKBKoEik
RjBEMQswCQYDVQQGEwJtZTEQMA4GA1UEChMHUG9zdGFDRzETMBEGA1UEAxMKUG9z
dGFDRyBDQTEOMAwGA1UEAxMFQ1JMNDUwgeOggeCggd2GW2xkYXA6Ly9sZGFwLnBv
c3RhY2ctY2EubWUvY249UG9zdGFDRyUyMENBLG89UG9zdGFDRyxjPW1lP2NlcnRp
ZmljYXRlUmV2b2NhdGlvbkxpc3QlM0JiaW5hcnmGPmh0dHA6Ly9laWQucG9zdGFj
Zy1jYS5tZS9jcmwvcG9zdGFjZ19jYV9wb3N0YWNnX21lX2NybGZpbGUuY3Jshj5o
dHRwOi8vd3d3LnBvc3RhY2ctY2EubWUvY3JsL3Bvc3RhY2dfY2FfcG9zdGFjZ19t
ZV9jcmxmaWxlLmNybDAfBgNVHSMEGDAWgBR3Y0xYMrlU0RoJ93Quq6uNPKoq8TAd
BgNVHQ4EFgQUV5q+2TeanEdIUlZlVxS81r6WkOwwDQYJKoZIhvcNAQELBQADggGB
AOBXnwm3bozLpkES2WypmCFHkFrNBmz9nm6XoLBsGx7uRcqRGsquQLVlAB/IRa+b
N14vQ6Vulcw9zv7kqDZFhi1txuWpvuxSZpx621EgZtIVDMUITmU8q9ezqNor7UgS
DhhfvIF6ZTkPM1UmBZpPMyLUtcxgZ1l3guZwu00ClcUQpb3S4710aM8CoFBGKHE9
65GXhSlriw0MUX0cgVANqV0FyKyuIOes2Lc7N0dHGKwKU8XbSziUaf+59Unigm5C
HxcT3ZvvMxl/+M65Whw4dkkajoeobpCm3YKuUb26/evjuH7EWki9dgKLQ1qSoDmQ
dDxIaNqK9c0hfbislxx3hrQcqQ9K/34Jr3sdS4Tq8142GRYoclKGebU62ds51a43
YfXo308Nx2mDsu6gd6yZvLP7JWBNB2Dvtc7bJHtciEOUtr5UN+AANgKG69JRRK4e
W4lhSwPSMKscth2PsAw0+hfi1i3aSThj6tTVrZLsnliMtrANXRJLETV9cbx7Ohzb
Sw==
</X509Certificate></X509Data></KeyInfo></Signature></RegisterInvoiceRequest>
</soapenv:Body>
            </soapenv:Envelope>